{"format": "graph-model", "generatedBy": "2.16.1", "convertedBy": "TensorFlow.js Converter v4.8.0", "signature": {"inputs": {"img": {"name": "img:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "288"}, {"size": "432"}, {"size": "3"}]}}}, "outputs": {"feature": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1944"}, {"size": "128"}]}}}}, "modelTopology": {"node": [{"name": "unknown_49", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_50", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_46/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_47/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_53", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_27", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_28", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_26/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_27/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_31", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.multiply_1/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "7"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_2/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_3/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_6/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_7/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_10/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_11/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_14/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_15/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_18/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_19/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_21", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_22", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_22/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_23/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_23", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_26", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_30/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_31/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_29", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_35", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_34/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_35/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_36", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_39", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_38/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_39/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_40", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_43", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_44", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_42/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_43/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_45", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_48", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_50/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_51/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_51", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_57", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_54/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_55/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_58", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_61", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_58/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_59/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "unknown_62", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_65", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.add_8/Add", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "36"}, {"size": "54"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.compat.v1.transpose_17/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_55/tf.reshape_25/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_55/feature/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "img", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "288"}, {"size": "432"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.multiply_1/Mul", "op": "Mul", "input": ["img", "PartitionedCall/model_55/tf.math.multiply_1/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.subtract/Sub", "op": "Sub", "input": ["PartitionedCall/model_55/tf.math.multiply_1/Mul", "unknown"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.compat.v1.pad/Pad", "op": "Pad", "input": ["PartitionedCall/model_55/tf.math.subtract/Sub", "unknown_0"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.convolution/convolution", "op": "Conv2D", "input": ["PartitionedCall/model_55/tf.compat.v1.pad/Pad", "unknown_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_2/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.nn.convolution/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_2/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.math.subtract_2/Sub", "op": "Sub", "input": ["PartitionedCall/model_55/tf.nn.convolution/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_2/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.squared_difference_1/SquaredDifference", "op": "SquaredDifference", "input": ["PartitionedCall/model_55/tf.nn.convolution/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_2/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_3/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.math.squared_difference_1/SquaredDifference", "PartitionedCall/model_55/tf.math.reduce_mean_3/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.__operators__.add_2/AddV2", "op": "AddV2", "input": ["PartitionedCall/model_55/tf.math.reduce_mean_3/Mean", "unknown_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.rsqrt_1/Rsqrt", "op": "Rsqrt", "input": ["PartitionedCall/model_55/tf.__operators__.add_2/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.multiply_6/Mul", "op": "Mul", "input": ["PartitionedCall/model_55/tf.math.subtract_2/Sub", "PartitionedCall/model_55/tf.math.rsqrt_1/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.relu/Relu", "op": "Relu", "input": ["PartitionedCall/model_55/tf.math.multiply_6/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.convolution_1/convolution", "op": "Conv2D", "input": ["PartitionedCall/model_55/tf.nn.relu/Relu", "unknown_5"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_6/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.nn.convolution_1/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_6/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.math.subtract_4/Sub", "op": "Sub", "input": ["PartitionedCall/model_55/tf.nn.convolution_1/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_6/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.squared_difference_3/SquaredDifference", "op": "SquaredDifference", "input": ["PartitionedCall/model_55/tf.nn.convolution_1/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_6/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_7/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.math.squared_difference_3/SquaredDifference", "PartitionedCall/model_55/tf.math.reduce_mean_7/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.__operators__.add_6/AddV2", "op": "AddV2", "input": ["PartitionedCall/model_55/tf.math.reduce_mean_7/Mean", "unknown_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.rsqrt_3/Rsqrt", "op": "Rsqrt", "input": ["PartitionedCall/model_55/tf.__operators__.add_6/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.multiply_10/Mul", "op": "Mul", "input": ["PartitionedCall/model_55/tf.math.subtract_4/Sub", "PartitionedCall/model_55/tf.math.rsqrt_3/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.relu_1/Relu", "op": "Relu", "input": ["PartitionedCall/model_55/tf.math.multiply_10/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.convolution_2/convolution", "op": "Conv2D", "input": ["PartitionedCall/model_55/tf.nn.relu_1/Relu", "unknown_9"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_10/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.nn.convolution_2/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_10/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.math.subtract_6/Sub", "op": "Sub", "input": ["PartitionedCall/model_55/tf.nn.convolution_2/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_10/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.squared_difference_5/SquaredDifference", "op": "SquaredDifference", "input": ["PartitionedCall/model_55/tf.nn.convolution_2/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_10/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_11/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.math.squared_difference_5/SquaredDifference", "PartitionedCall/model_55/tf.math.reduce_mean_11/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.__operators__.add_10/AddV2", "op": "AddV2", "input": ["PartitionedCall/model_55/tf.math.reduce_mean_11/Mean", "unknown_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.rsqrt_5/Rsqrt", "op": "Rsqrt", "input": ["PartitionedCall/model_55/tf.__operators__.add_10/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.multiply_14/Mul", "op": "Mul", "input": ["PartitionedCall/model_55/tf.math.subtract_6/Sub", "PartitionedCall/model_55/tf.math.rsqrt_5/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.relu_2/Relu", "op": "Relu", "input": ["PartitionedCall/model_55/tf.math.multiply_14/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.add/Add", "op": "AddV2", "input": ["PartitionedCall/model_55/tf.nn.relu/Relu", "PartitionedCall/model_55/tf.nn.relu_2/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.relu_3/Relu", "op": "Relu", "input": ["PartitionedCall/model_55/tf.math.add/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.convolution_3/convolution", "op": "Conv2D", "input": ["PartitionedCall/model_55/tf.nn.relu_3/Relu", "unknown_13"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_14/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.nn.convolution_3/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_14/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.math.subtract_8/Sub", "op": "Sub", "input": ["PartitionedCall/model_55/tf.nn.convolution_3/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_14/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.squared_difference_7/SquaredDifference", "op": "SquaredDifference", "input": ["PartitionedCall/model_55/tf.nn.convolution_3/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_14/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_15/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.math.squared_difference_7/SquaredDifference", "PartitionedCall/model_55/tf.math.reduce_mean_15/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.__operators__.add_14/AddV2", "op": "AddV2", "input": ["PartitionedCall/model_55/tf.math.reduce_mean_15/Mean", "unknown_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.rsqrt_7/Rsqrt", "op": "Rsqrt", "input": ["PartitionedCall/model_55/tf.__operators__.add_14/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.multiply_20/Mul", "op": "Mul", "input": ["PartitionedCall/model_55/tf.math.subtract_8/Sub", "PartitionedCall/model_55/tf.math.rsqrt_7/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.relu_4/Relu", "op": "Relu", "input": ["PartitionedCall/model_55/tf.math.multiply_20/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.convolution_4/convolution", "op": "Conv2D", "input": ["PartitionedCall/model_55/tf.nn.relu_4/Relu", "unknown_17"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_18/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.nn.convolution_4/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_18/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.math.subtract_10/Sub", "op": "Sub", "input": ["PartitionedCall/model_55/tf.nn.convolution_4/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_18/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.squared_difference_9/SquaredDifference", "op": "SquaredDifference", "input": ["PartitionedCall/model_55/tf.nn.convolution_4/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_18/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_19/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.math.squared_difference_9/SquaredDifference", "PartitionedCall/model_55/tf.math.reduce_mean_19/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.__operators__.add_18/AddV2", "op": "AddV2", "input": ["PartitionedCall/model_55/tf.math.reduce_mean_19/Mean", "unknown_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.rsqrt_9/Rsqrt", "op": "Rsqrt", "input": ["PartitionedCall/model_55/tf.__operators__.add_18/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.multiply_24/Mul", "op": "Mul", "input": ["PartitionedCall/model_55/tf.math.subtract_10/Sub", "PartitionedCall/model_55/tf.math.rsqrt_9/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.relu_5/Relu", "op": "Relu", "input": ["PartitionedCall/model_55/tf.math.multiply_24/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.add_1/Add", "op": "AddV2", "input": ["PartitionedCall/model_55/tf.nn.relu_3/Relu", "PartitionedCall/model_55/tf.nn.relu_5/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.relu_6/Relu", "op": "Relu", "input": ["PartitionedCall/model_55/tf.math.add_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.convolution_6/convolution", "op": "Conv2D", "input": ["PartitionedCall/model_55/tf.nn.relu_6/Relu", "unknown_27"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_55/tf.compat.v1.pad_1/Pad", "op": "Pad", "input": ["PartitionedCall/model_55/tf.nn.relu_6/Relu", "unknown_21"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.add_2/Add", "op": "AddV2", "input": ["PartitionedCall/model_55/tf.nn.convolution_6/convolution", "unknown_28"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.convolution_5/convolution", "op": "Conv2D", "input": ["PartitionedCall/model_55/tf.compat.v1.pad_1/Pad", "unknown_22"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_26/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.math.add_2/Add", "PartitionedCall/model_55/tf.math.reduce_mean_26/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_22/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.nn.convolution_5/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_22/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.math.subtract_14/Sub", "op": "Sub", "input": ["PartitionedCall/model_55/tf.math.add_2/Add", "PartitionedCall/model_55/tf.math.reduce_mean_26/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.squared_difference_13/SquaredDifference", "op": "SquaredDifference", "input": ["PartitionedCall/model_55/tf.math.add_2/Add", "PartitionedCall/model_55/tf.math.reduce_mean_26/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.subtract_12/Sub", "op": "Sub", "input": ["PartitionedCall/model_55/tf.nn.convolution_5/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_22/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.squared_difference_11/SquaredDifference", "op": "SquaredDifference", "input": ["PartitionedCall/model_55/tf.nn.convolution_5/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_22/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_27/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.math.squared_difference_13/SquaredDifference", "PartitionedCall/model_55/tf.math.reduce_mean_27/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_23/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.math.squared_difference_11/SquaredDifference", "PartitionedCall/model_55/tf.math.reduce_mean_23/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.__operators__.add_26/AddV2", "op": "AddV2", "input": ["PartitionedCall/model_55/tf.math.reduce_mean_27/Mean", "unknown_31"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.__operators__.add_22/AddV2", "op": "AddV2", "input": ["PartitionedCall/model_55/tf.math.reduce_mean_23/Mean", "unknown_23"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.rsqrt_13/Rsqrt", "op": "Rsqrt", "input": ["PartitionedCall/model_55/tf.__operators__.add_26/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.rsqrt_11/Rsqrt", "op": "Rsqrt", "input": ["PartitionedCall/model_55/tf.__operators__.add_22/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.multiply_34/Mul", "op": "Mul", "input": ["PartitionedCall/model_55/tf.math.subtract_14/Sub", "PartitionedCall/model_55/tf.math.rsqrt_13/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.multiply_30/Mul", "op": "Mul", "input": ["PartitionedCall/model_55/tf.math.subtract_12/Sub", "PartitionedCall/model_55/tf.math.rsqrt_11/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.relu_7/Relu", "op": "Relu", "input": ["PartitionedCall/model_55/tf.math.multiply_30/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.convolution_7/convolution", "op": "Conv2D", "input": ["PartitionedCall/model_55/tf.nn.relu_7/Relu", "unknown_26"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_30/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.nn.convolution_7/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_30/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.math.subtract_16/Sub", "op": "Sub", "input": ["PartitionedCall/model_55/tf.nn.convolution_7/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_30/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.squared_difference_15/SquaredDifference", "op": "SquaredDifference", "input": ["PartitionedCall/model_55/tf.nn.convolution_7/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_30/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_31/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.math.squared_difference_15/SquaredDifference", "PartitionedCall/model_55/tf.math.reduce_mean_31/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.__operators__.add_30/AddV2", "op": "AddV2", "input": ["PartitionedCall/model_55/tf.math.reduce_mean_31/Mean", "unknown_29"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.rsqrt_15/Rsqrt", "op": "Rsqrt", "input": ["PartitionedCall/model_55/tf.__operators__.add_30/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.multiply_38/Mul", "op": "Mul", "input": ["PartitionedCall/model_55/tf.math.subtract_16/Sub", "PartitionedCall/model_55/tf.math.rsqrt_15/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.relu_8/Relu", "op": "Relu", "input": ["PartitionedCall/model_55/tf.math.multiply_38/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.add_3/Add", "op": "AddV2", "input": ["PartitionedCall/model_55/tf.math.multiply_34/Mul", "PartitionedCall/model_55/tf.nn.relu_8/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.relu_9/Relu", "op": "Relu", "input": ["PartitionedCall/model_55/tf.math.add_3/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.convolution_8/convolution", "op": "Conv2D", "input": ["PartitionedCall/model_55/tf.nn.relu_9/Relu", "unknown_35"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_34/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.nn.convolution_8/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_34/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.math.subtract_18/Sub", "op": "Sub", "input": ["PartitionedCall/model_55/tf.nn.convolution_8/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_34/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.squared_difference_17/SquaredDifference", "op": "SquaredDifference", "input": ["PartitionedCall/model_55/tf.nn.convolution_8/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_34/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_35/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.math.squared_difference_17/SquaredDifference", "PartitionedCall/model_55/tf.math.reduce_mean_35/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.__operators__.add_34/AddV2", "op": "AddV2", "input": ["PartitionedCall/model_55/tf.math.reduce_mean_35/Mean", "unknown_36"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.rsqrt_17/Rsqrt", "op": "Rsqrt", "input": ["PartitionedCall/model_55/tf.__operators__.add_34/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.multiply_44/Mul", "op": "Mul", "input": ["PartitionedCall/model_55/tf.math.subtract_18/Sub", "PartitionedCall/model_55/tf.math.rsqrt_17/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.relu_10/Relu", "op": "Relu", "input": ["PartitionedCall/model_55/tf.math.multiply_44/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.convolution_9/convolution", "op": "Conv2D", "input": ["PartitionedCall/model_55/tf.nn.relu_10/Relu", "unknown_39"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_38/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.nn.convolution_9/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_38/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.math.subtract_20/Sub", "op": "Sub", "input": ["PartitionedCall/model_55/tf.nn.convolution_9/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_38/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.squared_difference_19/SquaredDifference", "op": "SquaredDifference", "input": ["PartitionedCall/model_55/tf.nn.convolution_9/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_38/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_39/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.math.squared_difference_19/SquaredDifference", "PartitionedCall/model_55/tf.math.reduce_mean_39/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.__operators__.add_38/AddV2", "op": "AddV2", "input": ["PartitionedCall/model_55/tf.math.reduce_mean_39/Mean", "unknown_40"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.rsqrt_19/Rsqrt", "op": "Rsqrt", "input": ["PartitionedCall/model_55/tf.__operators__.add_38/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.multiply_48/Mul", "op": "Mul", "input": ["PartitionedCall/model_55/tf.math.subtract_20/Sub", "PartitionedCall/model_55/tf.math.rsqrt_19/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.relu_11/Relu", "op": "Relu", "input": ["PartitionedCall/model_55/tf.math.multiply_48/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.add_4/Add", "op": "AddV2", "input": ["PartitionedCall/model_55/tf.nn.relu_9/Relu", "PartitionedCall/model_55/tf.nn.relu_11/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.relu_12/Relu", "op": "Relu", "input": ["PartitionedCall/model_55/tf.math.add_4/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.convolution_11/convolution", "op": "Conv2D", "input": ["PartitionedCall/model_55/tf.nn.relu_12/Relu", "unknown_49"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_55/tf.compat.v1.pad_2/Pad", "op": "Pad", "input": ["PartitionedCall/model_55/tf.nn.relu_12/Relu", "unknown_43"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.add_5/Add", "op": "AddV2", "input": ["PartitionedCall/model_55/tf.nn.convolution_11/convolution", "unknown_50"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.convolution_10/convolution", "op": "Conv2D", "input": ["PartitionedCall/model_55/tf.compat.v1.pad_2/Pad", "unknown_44"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_46/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.math.add_5/Add", "PartitionedCall/model_55/tf.math.reduce_mean_46/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_42/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.nn.convolution_10/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_42/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.math.subtract_24/Sub", "op": "Sub", "input": ["PartitionedCall/model_55/tf.math.add_5/Add", "PartitionedCall/model_55/tf.math.reduce_mean_46/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.squared_difference_23/SquaredDifference", "op": "SquaredDifference", "input": ["PartitionedCall/model_55/tf.math.add_5/Add", "PartitionedCall/model_55/tf.math.reduce_mean_46/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.subtract_22/Sub", "op": "Sub", "input": ["PartitionedCall/model_55/tf.nn.convolution_10/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_42/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.squared_difference_21/SquaredDifference", "op": "SquaredDifference", "input": ["PartitionedCall/model_55/tf.nn.convolution_10/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_42/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_47/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.math.squared_difference_23/SquaredDifference", "PartitionedCall/model_55/tf.math.reduce_mean_47/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_43/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.math.squared_difference_21/SquaredDifference", "PartitionedCall/model_55/tf.math.reduce_mean_43/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.__operators__.add_46/AddV2", "op": "AddV2", "input": ["PartitionedCall/model_55/tf.math.reduce_mean_47/Mean", "unknown_53"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.__operators__.add_42/AddV2", "op": "AddV2", "input": ["PartitionedCall/model_55/tf.math.reduce_mean_43/Mean", "unknown_45"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.rsqrt_23/Rsqrt", "op": "Rsqrt", "input": ["PartitionedCall/model_55/tf.__operators__.add_46/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.rsqrt_21/Rsqrt", "op": "Rsqrt", "input": ["PartitionedCall/model_55/tf.__operators__.add_42/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.multiply_58/Mul", "op": "Mul", "input": ["PartitionedCall/model_55/tf.math.subtract_24/Sub", "PartitionedCall/model_55/tf.math.rsqrt_23/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.multiply_54/Mul", "op": "Mul", "input": ["PartitionedCall/model_55/tf.math.subtract_22/Sub", "PartitionedCall/model_55/tf.math.rsqrt_21/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.relu_13/Relu", "op": "Relu", "input": ["PartitionedCall/model_55/tf.math.multiply_54/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.convolution_12/convolution", "op": "Conv2D", "input": ["PartitionedCall/model_55/tf.nn.relu_13/Relu", "unknown_48"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_50/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.nn.convolution_12/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_50/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.math.subtract_26/Sub", "op": "Sub", "input": ["PartitionedCall/model_55/tf.nn.convolution_12/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_50/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.squared_difference_25/SquaredDifference", "op": "SquaredDifference", "input": ["PartitionedCall/model_55/tf.nn.convolution_12/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_50/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_51/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.math.squared_difference_25/SquaredDifference", "PartitionedCall/model_55/tf.math.reduce_mean_51/Mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.__operators__.add_50/AddV2", "op": "AddV2", "input": ["PartitionedCall/model_55/tf.math.reduce_mean_51/Mean", "unknown_51"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.rsqrt_25/Rsqrt", "op": "Rsqrt", "input": ["PartitionedCall/model_55/tf.__operators__.add_50/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.multiply_62/Mul", "op": "Mul", "input": ["PartitionedCall/model_55/tf.math.subtract_26/Sub", "PartitionedCall/model_55/tf.math.rsqrt_25/Rsqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.relu_14/Relu", "op": "Relu", "input": ["PartitionedCall/model_55/tf.math.multiply_62/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.math.add_6/Add", "op": "AddV2", "input": ["PartitionedCall/model_55/tf.math.multiply_58/Mul", "PartitionedCall/model_55/tf.nn.relu_14/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.relu_15/Relu", "op": "Relu", "input": ["PartitionedCall/model_55/tf.math.add_6/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_55/tf.nn.convolution_13/convolution", "op": "Conv2D", "input": ["PartitionedCall/model_55/tf.nn.relu_15/Relu", "unknown_57"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model_55/tf.math.reduce_mean_54/Mean", "op": "Mean", "input": ["PartitionedCall/model_55/tf.nn.convolution_13/convolution", "PartitionedCall/model_55/tf.math.reduce_mean_54/Mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "PartitionedCall/model_55/tf.math.subtract_28/Sub", "op": 